flit/argon-rtos/test/kinetis/devices/MKL28T7/fsl_clock.h
/*! @brief Clock ip name array for LPIT. */
#define LPIT_CLOCKS                \
    {                              \
        kCLOCK_Lpit0, kCLOCK_Lpit1 \
    }

/*! @brief Clock ip name array for CRC. */
#define CRC_CLOCKS  \
    {               \
        kCLOCK_Crc0 \
    }

/*! @brief Clock ip name array for CMP. */
#define CMP_CLOCKS               \
    {                            \
        kCLOCK_Cmp0, kCLOCK_Cmp1 \
    }

/*! @brief Clock ip name array for XRDC. */
#define XRDC_CLOCKS  \
    {                \
        kCLOCK_Xrdc0 \
    }

/*! @brief Clock ip name array for FLASH. */
#define FLASH_CLOCKS  \
    {                 \
        kCLOCK_Flash0 \
    }

/*! @brief Clock ip name array for MU. */
#define MU_CLOCKS                \
    {                            \
        kCLOCK_Mu0A, kCLOCK_Mu0B \
    }

/*! @brief Clock ip name array for SEMA. */
#define SEMA_CLOCKS                    \
    {                                  \
        kCLOCK_Sema420, kCLOCK_Sema421 \
    }

/*!
 * @brief LPO clock frequency.
 */
#define LPO_CLK_FREQ 1000U

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{

    /* ---------------------------- System layer clock -----------------------*/
    kCLOCK_CoreSysClk, /*!< Core/system clock                                 */
    kCLOCK_PlatClk,    /*!< Platform clock                                    */
    kCLOCK_BusClk,     /*!< Bus clock                                         */
    kCLOCK_FlexBusClk, /*!< FlexBus clock                                     */
    kCLOCK_FlashClk,   /*!< Flash clock                                       */

    /* ------------------------------------ SCG clock ------------------------*/
    kCLOCK_ScgSysOscClk, /*!< SCG system OSC clock. (SYSOSC)                  */
    kCLOCK_ScgSircClk,   /*!< SCG SIRC clock.                                 */
    kCLOCK_ScgFircClk,   /*!< SCG FIRC clock.                                 */
    kCLOCK_ScgSysPllClk, /*!< SCG system PLL clock. (SYSPLL)                  */

    kCLOCK_ScgSysOscAsyncDiv1Clk, /*!< SOSCDIV1_CLK.                          */
    kCLOCK_ScgSysOscAsyncDiv2Clk, /*!< SOSCDIV2_CLK.                          */
    kCLOCK_ScgSysOscAsyncDiv3Clk, /*!< SOSCDIV3_CLK.                          */

    kCLOCK_ScgSircAsyncDiv1Clk, /*!< SIRCDIV1_CLK.                            */
    kCLOCK_ScgSircAsyncDiv2Clk, /*!< SIRCDIV2_CLK.                            */
    kCLOCK_ScgSircAsyncDiv3Clk, /*!< SIRCDIV3_CLK.                            */

    kCLOCK_ScgFircAsyncDiv1Clk, /*!< FIRCDIV1_CLK.                            */
    kCLOCK_ScgFircAsyncDiv2Clk, /*!< FIRCDIV2_CLK.                            */
    kCLOCK_ScgFircAsyncDiv3Clk, /*!< FIRCDIV3_CLK.                            */

    kCLOCK_ScgSysPllAsyncDiv1Clk, /*!< SPLLDIV1_CLK.                          */
    kCLOCK_ScgSysPllAsyncDiv2Clk, /*!< SPLLDIV2_CLK.                          */
    kCLOCK_ScgSysPllAsyncDiv3Clk, /*!< SPLLDIV3_CLK.                          */

    /* -------------------------------- Other clock --------------------------*/
    kCLOCK_LpoClk,    /*!< LPO clock                                          */
    kCLOCK_Osc32kClk, /*!< External OSC 32K clock (OSC32KCLK)                 */
    kCLOCK_ErClk,     /*!< ERCLK. The external reference clock from SCG.      */
} clock_name_t;

#define kCLOCK_Osc0ErClk kCLOCK_ErClk                /*!< For compatible with other MCG platforms. */
#define kCLOCK_Er32kClk kCLOCK_Osc32kClk             /*!< For compatible with other MCG platforms. */
#define CLOCK_GetOsc0ErClkFreq CLOCK_GetErClkFreq    /*!< For compatible with other MCG platforms. */
#define CLOCK_GetEr32kClkFreq CLOCK_GetOsc32kClkFreq /*!< For compatible with other MCG platforms. */

/*!
 * @brief Clock source for peripherals that support various clock selections.
 */
typedef enum _clock_ip_src
{
    kCLOCK_IpSrcNoneOrExt = 0U,   /*!< Clock is off or external clock is used. */
    kCLOCK_IpSrcSysOscAsync = 1U, /*!< System Oscillator async clock.          */
    kCLOCK_IpSrcSircAsync = 2U,   /*!< Slow IRC async clock.                   */
    kCLOCK_IpSrcFircAsync = 3U,   /*!< Fast IRC async clock.                   */
    kCLOCK_IpSrcSysPllAsync = 6U  /*!< System PLL async clock.                 */
} clock_ip_src_t;

/*!
 * @brief Peripheral clock name difinition used for clock gate, clock source
 * and clock divider setting. It is defined as the corresponding register address.
 */
typedef enum _clock_ip_name
{
    kCLOCK_IpInvalid = 0U,
    /* PCC 0 */
    kCLOCK_Dma0 = 0x4007A020U,
    kCLOCK_Xrdc0 = 0x4007A050U,
    kCLOCK_Sema420 = 0x4007A06CU,
    kCLOCK_Flash0 = 0x4007A080U,
    kCLOCK_Dmamux0 = 0x4007A084U,
    kCLOCK_Mu0A = 0x4007A08CU,
    kCLOCK_Intmux0 = 0x4007A090U,
    kCLOCK_Tpm2 = 0x4007A0B8U,
    kCLOCK_Lpit0 = 0x4007A0C0U,
    kCLOCK_Lptmr0 = 0x4007A0D0U,
    kCLOCK_Rtc0 = 0x4007A0E0U,
    kCLOCK_Lpspi2 = 0x4007A0F8U,
    kCLOCK_Lpi2c2 = 0x4007A108U,
    kCLOCK_Lpuart2 = 0x4007A118U,
    kCLOCK_Sai0 = 0x4007A130U,
    kCLOCK_Emvsim0 = 0x4007A138U,
    kCLOCK_Usbfs0 = 0x4007A154U,
    kCLOCK_PortA = 0x4007A168U,
    kCLOCK_PortB = 0x4007A16CU,
    kCLOCK_PortC = 0x4007A170U,
    kCLOCK_PortD = 0x4007A174U,
    kCLOCK_PortE = 0x4007A178U,
    kCLOCK_Tsi0 = 0x4007A188U,
    kCLOCK_Adc0 = 0x4007A198U,
    kCLOCK_Dac0 = 0x4007A1A8U,
    kCLOCK_Cmp0 = 0x4007A1B8U,
    kCLOCK_Vref0 = 0x4007A1C8U,
    kCLOCK_Atx0 = 0x4007A1CCU,
    kCLOCK_Crc0 = 0x4007A1E0U,

    /* PCC 1 */
    kCLOCK_Dma1 = 0x400FA020U,
    kCLOCK_Sema421 = 0x400FA06CU,
    kCLOCK_Dmamux1 = 0x400FA084U,
    kCLOCK_Mu0B = 0x400FA08CU,
    kCLOCK_Intmux1 = 0x400FA090U,
    kCLOCK_Trng0 = 0x400FA094U,
    kCLOCK_Tpm0 = 0x400FA0B0U,
    kCLOCK_Tpm1 = 0x400FA0B4U,
    kCLOCK_Lpit1 = 0x400FA0C4U,
    kCLOCK_Lptmr1 = 0x400FA0D4U,
    kCLOCK_Lpspi0 = 0x400FA0F0U,
    kCLOCK_Lpspi1 = 0x400FA0F4U,
    kCLOCK_Lpi2c0 = 0x400FA100U,
    kCLOCK_Lpi2c1 = 0x400FA104U,
    kCLOCK_Lpuart0 = 0x400FA110U,
    kCLOCK_Lpuart1 = 0x400FA114U,
    kCLOCK_Flexio0 = 0x400FA128U,
    kCLOCK_PortM = 0x400FA180U,
    kCLOCK_Cmp1 = 0x400FA1BCU,
} clock_ip_name_t;

/*!
 * @brief SCG status return codes.
 */
enum _scg_status
{
    kStatus_SCG_Busy = MAKE_STATUS(kStatusGroup_SCG, 1),      /*!< Clock is busy.  */
    kStatus_SCG_InvalidSrc = MAKE_STATUS(kStatusGroup_SCG, 2) /*!< Invalid source. */
};

/*!
 * @brief SCG system clock type.
 */
typedef enum _scg_sys_clk
{
    kSCG_SysClkCore, /*!< Core clock.        */
#if (defined(FSL_FEATURE_SCG_HAS_DIVBUS) && FSL_FEATURE_SCG_HAS_DIVBUS)
    kSCG_SysClkBus, /*!< Bus clock.         */
#endif
#if (defined(FSL_FEATURE_SCG_HAS_DIVPLAT) && FSL_FEATURE_SCG_HAS_DIVPLAT)
    kSCG_SysClkPlat, /*!< Platform clock.    */
#endif
    kSCG_SysClkSlow /*!< System slow clock. */
} scg_sys_clk_t;

/*!
 * @brief SCG system clock source.
 */
typedef enum _scg_sys_clk_src
{
    kSCG_SysClkSrcSysOsc = 1U, /*!< System OSC. */
    kSCG_SysClkSrcSirc = 2U,   /*!< Slow IRC.   */
    kSCG_SysClkSrcFirc = 3U,   /*!< Fast IRC.   */
    kSCG_SysClkSrcSysPll = 6U  /*!< System PLL. */
} scg_sys_clk_src_t;

/*!
 * @brief SCG system clock divider value.
 */
typedef enum _scg_sys_clk_div
{
    kSCG_SysClkDivBy1 = 0U,   /*!< Divided by 1.  */
    kSCG_SysClkDivBy2 = 1U,   /*!< Divided by 2.  */
    kSCG_SysClkDivBy3 = 2U,   /*!< Divided by 3.  */
    kSCG_SysClkDivBy4 = 3U,   /*!< Divided by 4.  */
    kSCG_SysClkDivBy5 = 4U,   /*!< Divided by 5.  */
    kSCG_SysClkDivBy6 = 5U,   /*!< Divided by 6.  */
    kSCG_SysClkDivBy7 = 6U,   /*!< Divided by 7.  */
    kSCG_SysClkDivBy8 = 7U,   /*!< Divided by 8.  */
    kSCG_SysClkDivBy9 = 8U,   /*!< Divided by 9.  */
    kSCG_SysClkDivBy10 = 9U,  /*!< Divided by 10. */
    kSCG_SysClkDivBy11 = 10U, /*!< Divided by 11. */
    kSCG_SysClkDivBy12 = 11U, /*!< Divided by 12. */
    kSCG_SysClkDivBy13 = 12U, /*!< Divided by 13. */
    kSCG_SysClkDivBy14 = 13U, /*!< Divided by 14. */
    kSCG_SysClkDivBy15 = 14U, /*!< Divided by 15. */
    kSCG_SysClkDivBy16 = 15U  /*!< Divided by 16. */
} scg_sys_clk_div_t;

/*!
 * @brief SCG system clock configuration.
 */
typedef struct _scg_sys_clk_config
{
    uint32_t divSlow : 4; /*!< Slow clock divider, see @ref scg_sys_clk_div_t. */
#if (defined(FSL_FEATURE_SCG_HAS_DIVBUS) && FSL_FEATURE_SCG_HAS_DIVBUS)
    uint32_t divBus : 4; /*!< Bus clock divider, see @ref scg_sys_clk_div_t.  */
#else
    uint32_t reseved1 : 4; /*!< Reserved. */
#endif
    uint32_t reseved2 : 4; /*!< Reserved. */

#if (defined(FSL_FEATURE_SCG_HAS_DIVPLAT) && FSL_FEATURE_SCG_HAS_DIVPLAT)
    uint32_t divPlat : 4; /*!< Platform clock divider, see @ref scg_sys_clk_div_t.*/
#else
    uint32_t reseved3 : 4; /*!< Reserved. */
#endif

    uint32_t divCore : 4; /*!< Core clock divider, see @ref scg_sys_clk_div_t. */

    uint32_t reseved4 : 4; /*!< Reserved. */

